cf/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РедактированиеЦеныВДокументе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольВремениПосещений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретЧужихРазмещений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановитьНовыйПарольПриВходе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРозничныйМагазин</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>idДиалогаТелеграм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КтоМожетПросматриватьСтоимость</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрофилиИнтернетПочты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Профиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрофильИнтернетПочты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/BotKotОбработкаСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>BotKotОбработкаСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящееСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящееСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonModules/BotKot/Ext/Module.bsl
Функция Ключ() Экспорт 		Возврат "204144897:AAHqE3GisnL9Gzv-RnPLAozL0EP1BDp1A4I" КонецФункции
Функция Сервер() Экспорт 	Возврат "api.telegram.org" КонецФункции

Функция СообщитьКоту(idUser, ТекстСообщения) Экспорт
	
	Ресурс 		= "bot" + Ключ() + "/sendMessage?chat_id=" + idUser + "&text=" + ТекстСообщения;
	Соединение  =  Новый HTTPСоединение(Сервер(), 443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	ЗапросHTTP 	= Новый HTTPЗапрос(Ресурс);
	Ответ 		= Соединение.Получить(ЗапросHTTP);
	
	Возврат Ответ.КодСостояния = 200;
				
КонецФункции

Функция СформироватьСообщение(ВходящееСообщение, ИсходящееСообщение, Алгоритм, стрОшибки = "")
	
	Попытка		Выполнить(Алгоритм);
	Исключение
		стрОшибки = "Ошибка выполняения алгоритма - " + ОписаниеОшибки();
		Возврат Ложь; КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция ПоследнииСообщенияПользователя(idUser, Первые = 0)
	
	// Возвращает массив последних сообщений пользователя
	
	//Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 ИЗ РегистрСведений.
	
	
КонецФункции

Функция ПолучитьПользователя(idUser)
	
	Запрос 	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.Пользователи ГДЕ idДиалогаТелеграм = """ + idUser + """");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка КонецЕсли;
	
КонецФункции
Функция ВыполнитьПравилоКота(СтруктураСообщения, Алгоритм, ИсходящееСообщение, стрОшибки = "")
	
	Если ПустаяСтрока(Алгоритм) И Не ПустаяСтрока(ИсходящееСообщение) Тогда
		
		Возврат Истина;
		
	ИначеЕсли ПустаяСтрока(Алгоритм) И ПустаяСтрока(ИсходящееСообщение) Тогда
		
		стрОшибки = "Человек ты глупый
		|Ни алгоритм ни Исходящее сообщение не заполнено";
		Возврат Ложь;
		
	Иначе
	
		Отказ = Ложь;
		
		Попытка		Выполнить Алгоритм;
		Исключение	стрОшибки = "Человек ты глупый
								|" + ОписаниеОшибки();
					Возврат Ложь; КонецПопытки;
		
		Возврат Не Отказ; КонецЕсли;
	
КонецФункции
Функция ПолученоВходящееСообщение(ЗапросHTTP, стрОшибки = "") Экспорт
	
	текJSONСообщения = ЗапросHTTP.ПолучитьТелоКакСтроку();
	
	// преобразуем в структуру
			
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(текJSONСообщения);
	Структура = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	
	Если Структура.Свойство("message") Тогда
		
		// Заполним параметрами
		
		СтруктураСообщения = Новый Структура;
		
		Если Структура.message.Свойство("from") И Структура.message.from.Свойство("id") Тогда
			idUser = Формат(Структура.message.from.id, "ЧГ=");
			СтруктураСообщения.Вставить("Пользователь", ПолучитьПользователя(idUser)) КонецЕсли;
		
		Если Структура.message.Свойство("text") Тогда
			СтруктураСообщения.Вставить("Текст", Структура.message.text) КонецЕсли;
			
		Если Структура.message.Свойство("date") Тогда
			СтруктураСообщения.Вставить("Дата", МестноеВремя(Дата('19700101') + Структура.message.date)) КонецЕсли;
		
		// Найдем ответ из справочника
		
		Если СтруктураСообщения.Свойство("Текст") И Не ПустаяСтрока(СтруктураСообщения.Текст) Тогда
		
			Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 ИсходящееСообщение, Алгоритм ИЗ Справочник.BotKotОбработкаСообщений ГДЕ НЕ ПометкаУдаления И ВходящееСообщение ПОДОБНО """ + СтруктураСообщения.Текст + """");
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				
				// Если есть алгоритм выполняем сперва его, а затем полученное исходящее сообщение
				
				ИсходящееСообщение = Выборка.ИсходящееСообщение; // защита переменной
				
				стрОшибки = "";
				Если ВыполнитьПравилоКота(СтруктураСообщения, Выборка.Алгоритм, ИсходящееСообщение, стрОшибки) Тогда
					СообщитьКоту(idUser, ИсходящееСообщение); 
				Иначе
					СообщитьКоту(idUser, стрОшибки); КонецЕсли; 
				
			Иначе // выполним полнотекстовый поиск
				
				СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок(СтруктураСообщения.Текст, 1);
				//СписокПоиска.ПолучитьОтображение(ВидОтображенияПолнотекстовогоПоиска.HTMLТекст);
				Если СписокПоиска.Количество() Тогда
					Эл = СписокПоиска.Получить(0);
					СообщитьКоту(idUser, Строка(Эл.Значение) + " " + Эл.Описание + " " + Эл.Представление); КонецЕсли; КонецЕсли; КонецЕсли; КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
